m1/emacs/init.org
#+startup: content
#+property: header-args :tangle init.el

* Personal Config

#+begin_src emacs-lisp
(defcustom my/dark-theme 'modus-vivendi-tinted
  "My default dark theme")
(defcustom my/light-theme 'modus-operandi-tinted
  "My default light theme")
(defcustom my/notes-location (expand-file-name "~/Documents/notes")
  "My default notes location")
(defcustom my/frame 'pos
  "floating frame system, can be 'mini or 'pos")
#+end_src
* Core

** get the correct env
#+begin_src emacs-lisp
(use-package exec-path-from-shell
  :config
  (exec-path-from-shell-initialize)
  (if (and (fboundp 'native-comp-available-p)
	   (native-comp-available-p))
      (progn
	(message "Native comp is available")
	  ;;; Using Emacs.app/Contents/MacOS/bin since it was compiled with
	  ;;; ./configure --prefix="$PWD/nextstep/Emacs.app/Contents/MacOS"
	  ;;; Append to path to give priority to values from exec-path-from-shell-initialize.
	(add-to-list 'exec-path (concat invocation-directory (file-name-as-directory "bin")) t)
	(setenv "LIBRARY_PATH" (concat (getenv "LIBRARY_PATH")
				       (when (getenv "LIBRARY_PATH")
					 ":")
					 ;;; This is where Homebrew puts libgccjit libraries.
				       (car (file-expand-wildcards
					     (expand-file-name "/opt/homebrew/opt/libgccjit/lib/gcc/*")))))
	  ;;; Only set after LIBRARY_PATH can find gcc libraries.
	(setq comp-deferred-compilation t)
	(setq comp-speed 3))
    (message "Native comp is *not* available")))

#+end_src

** keep things tidy

#+begin_src emacs-lisp
(use-package no-littering)

(setq backup-directory-alist
      `(("\\`/tmp/" . nil)
	("\\`/dev/shm/" . nil)
	("." . ,(no-littering-expand-var-file-name "backup/"))))

(setq auto-save-file-name-transforms
      `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

(setq auto-save-file-name-transforms
      `(("\\`/[^/]*:\\([^/]*/\\)*\\([^/]*\\)\\'"
	 ,(concat temporary-file-directory "\\2") t)
	("\\`\\(/tmp\\|/dev/shm\\)\\([^/]*/\\)*\\(.*\\)\\'" "\\3")
	(".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

(recentf-mode 1)
(add-to-list 'recentf-exclude no-littering-var-directory)
(add-to-list 'recentf-exclude no-littering-etc-directory)

(setq custom-file (no-littering-expand-etc-file-name "custom.el"))

(setq auto-save-file-name-transforms
      `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
#+end_src

** secret

#+begin_src emacs-lisp
;; (setenv "GPG_TTY" "$(tty)")
(require 'epa-file)
(epa-file-enable)
(setenv "GPG_AGENT_INFO" nil)
(setq pg-gpg-program "gpg2")
(setq epg-pinentry-mode 'loopback)
(setq auth-source-debug t)
#+end_src

** server

#+begin_src emacs-lisp
(server-start)
#+end_src

* UI

** simple and clean

These just for not hurting my eyes when using emacs.
#+begin_src emacs-lisp
(scroll-bar-mode -1)
;; (menu-bar-mode -1)
(tool-bar-mode -1)
(blink-cursor-mode -1)
(fset 'yes-or-no-p 'y-or-n-p)
(global-display-line-numbers-mode 1)
(setq display-line-numbers-type 'relative)
(setq inhibit-startup-screen t)
(setq backup-by-copying t)

;; (use-package face-remap
;;   :ensure nil
;;   :custom-face
;;   (fixed-pitch ((t (:family "JetBrainsMono Nerd Font" :height 1.0))))
;;   (org-block ((t (:inheerit fixed-pitch))))
;;   :hook
;;   (org-mode-hook . variable-pitch-mode))
#+end_src

** Icons & Fonts

#+begin_src emacs-lisp
;; icons
(use-package all-the-icons
  :if (display-graphic-p))

;; fonts
(let* ((candidates '("JetBrainsMono Nerd Font-16" "Hack Nerd Font-16" "Fira Code-16"))
       (chosen (seq-find (lambda (n) (member n (font-family-list))) candidates "JetBrainsMono Nerd Font-16")))
  (cl-pushnew
   (cons 'font chosen)
   default-frame-alist
   :key #'car :test #'eq))
#+end_src

** mixed pitch

#+begin_src emacs-lisp
(use-package mixed-pitch
  :hook
  ;; If you want it in all text modes:
  ((org-mode markdown-mode) . mixed-pitch-mode))
#+end_src

** modeline

#+begin_src emacs-lisp
(use-package doom-modeline
  :init (doom-modeline-mode 1)
  ;;; :custom ((doom-modeline-height 15))
  )
#+end_src

** highlight line

#+begin_src emacs-lisp
(use-package hl-line ; built in
  :ensure nil
  :hook ((prog-mode text-mode conf-mode) . hl-line-mode)
  :config
  ;;; I don't need hl-line showing in other windows. This also offers a small
  ;;; speed boost when buffer is displayed in multiple windows.
  (setq hl-line-sticky-flag nil
	global-hl-line-sticky-flag nil))
#+end_src

** theme

*** theme changing

Toggle theme when system theme changes. This is for the macport version of emacs.
Ideas from [[https://www.reddit.com/r/emacs/comments/ym9jw3/comment/ive4zk8/?utm_source=share&utm_medium=web2x&context=3][here]].

#+begin_src emacs-lisp
(defun my/toggle-theme ()
  "Load theme, taking current system APPEARANCE into consideration."
  (mapc #'disable-theme custom-enabled-themes)
  (let ((appearance (plist-get (mac-application-state) :appearance)))
    (cond ((equal appearance "NSAppearanceNameAqua")
           (load-theme my/light-theme :no-confirm))
          ((equal appearance "NSAppearanceNameDarkAqua")
           (load-theme my/dark-theme :no-confirm)))))

(add-hook 'after-init-hook 'my/toggle-theme)
(add-hook 'mac-effective-appearance-change-hook 'my/toggle-theme)
#+end_src

*** ef-themes

#+begin_src emacs-lisp :tangle no
(use-package ef-themes
  :custom
  (my/dark-theme 'ef-bio)
  (my/light-theme 'ef-frost)
  (ef-themes-headings
    '((1 light variable-pitch 1.5)
       (2 regular 1.3)
       (3 1.1)
       (agenda-date 1.3)
       (agenda-structure variable-pitch light 1.8)
       (t variable-pitch)))
  :config
  (load-theme 'ef-bio :no-confirm))


;;; only works with emacs-plus
(defun my/toggle-theme (appearance)
  "Load theme, taking current system APPEARANCE into consideration."
  (mapc #'disable-theme custom-enabled-themes)
  (pcase appearance
    ('light
     (progn (enable-theme my/light-theme)
	    (disable-theme my/dark-theme)))
    ('dark
     (progn (enable-theme my/dark-theme)
	    (disable-theme my/light-theme)))
    )
  )
#+end_src

