m1/emacs/init.org
** bindings

#+begin_src emacs-lisp
(tyrant!
  "M-o" 'find-file
  "M-d" 'dired-jump
  "M-w" 'evil-quit
  "M-q" 'save-buffers-kill-terminal
  "M-p" 'projectile-find-file-dwim
  "M-P" 'projectile-switch-project
  "M-r" 'consult-recent-file
  "M-b" 'consult-buffer
  "M-B" 'consult-project-buffer
  "M-g" 'magit-status
  "M-s" 'save-buffer
  "M-S" 'save-some-buffers
  "M-v" 'yank
  "M-a" 'mark-whole-buffer
  "M-f" 'consult-line
  "M-F" 'consult-ripgrep
  "M-t" 'vterm
  "M-=" 'text-scale-increase
  "M--" 'text-scale-decrease
  "M-0" (lambda () (interactive) (text-scale-set 0)))

(leader!
  "u" '(universal-argument :which-key "universal argument")
  "`" '("switch" . evil-switch-to-windows-last-buffer)
  "o" '(nil :which-key "open")
  ;; "o o" '+macos/reveal-in-finder
  "x" '(nil :which-key "eval")
  "x x" '("eval" . elisp-eval-region-or-buffer))

(leader!
  "h" '(nil :which-key "help")
  "h h" '("help" . help-for-help)
  "h f" '("function" . describe-function)
  "h v" '("variable" . describe-variable)
  "h k" '("key" . describe-key)
  "h c" '("cursor" . what-cursor-position)
  )

(leader!
  "a" '(nil :which-key "app")
  "f" '(nil :which-key "file")
  "fr" '(consult-recent-file :which-key "recent files")
  "fR" '(consult-recent-file :which-key "recent files")
  "ff" '(find-file :which-key "find file"))

(leader!
  "b" '(nil :which-key "buffer")
  "bb" '(consult-buffer :which-key "switch buffer")
  "bB" '(consult-project-buffer :which-key "project buffer")
  "bm" '(bookmark-set :which-key "set bookmark")
  "bM" '(bookmark-delete :which-key "delete bookmark")
  "bk" '(kill-this-buffer :which-key "kill buffer"))

(leader!
  "p" '(nil :which-key "project")
  "pf" '(projectile-find-file-dwim :which-key "find file")
  "pp" '(projectile-switch-project :which-key "find project")
  "pb" '(consult-project-buffer :which-key "project buffer"))

(leader!
  "s" '(nil :which-key "search")
  "sm" '(bookmark-jump :which-key "jump to bookmark")
  "sb" '(consult-line :which-key "search buffer")
  "sB" '(consult-line-multi 'all-buffer :which-key "search all open buffer")
  "sp" '(consult-ripgrep :which-key "search project")
  "sB" '(consult-line-multi 'all-buffer :which-key "search all open buffer"))
#+end_src

* Editor

#+begin_src emacs-lisp
;; search
(use-package anzu
  :config
  (global-anzu-mode +1))

(use-package evil-anzu
  :after evil
  :config
  (require 'evil-anzu))

;; remember notes
(setq initial-buffer-choice 'remember-notes
      remember-data-file (expand-file-name "remember.org" my/notes-location)
      remember-notes-initial-major-mode 'org-mode
      remember-notes-auto-save-visited-file t)

;; find file TODO: assign keys
(use-package affe
  :config
  (consult-customize affe-grep :preview-key (kbd "M-."))
  ;; -*- lexical-binding: t -*-
  (defun affe-orderless-regexp-compiler (input _type _ignorecase)
    (setq input (orderless-pattern-compiler input))
    (cons input (apply-partially #'orderless--highlight input)))
  (setq affe-regexp-compiler #'affe-orderless-regexp-compiler))

(use-package bufler
  :general
  (leader! "bb" #'bufler)
  (:keymaps 'bufler-list-mode-map
            :states 'normal
            "," 'hydra:bufler/body
            "RET" 'bufler-list-buffer-switch
            "SPC" 'bufler-list-buffer-peek
            "d" 'bufler-list-buffer-kill))

(use-package crux
  :commands crux-open-with
  :general
  (leader! "f r" #'crux-recentf-find-file))
#+end_src

** COMMENT mini-frame

#+begin_src emacs-lisp
(use-package mini-frame
  :if (eq my/frame 'mini)
  :config
  (mini-frame-mode 1))
#+end_src

