m1/emacs/init.org
** Vertico

#+begin_src emacs-lisp
(use-package vertico
  :init
  (vertico-mode))

(use-package vertico-directory
  :after vertico
  :ensure nil
  ;; More convenient directory navigation commands
  :general
  (vertico-map
   "DEL"  'vertico-directory-delete-char
   "M-DEL"  'vertico-directory-delete-word)
  ;;; Tidy shadowed file names
  :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))

(use-package savehist
  :ensure nil
  :init
  (savehist-mode))

(use-package orderless
  :init
  (setq completion-styles '(orderless partial-completion basic)))

(use-package marginalia
  :init
  (marginalia-mode))

;; TODO: add meaningful bindings
(use-package embark
  :bind
  ("M-." . embark-act)
  ("M-;" . embark-dwim)
  ("M-e" . embark-export)
  ("C-h B" . embark-bindings))

(use-package embark-consult
  :hook
  (embark-collect-mode . consult-preview-at-point-mode))

(use-package wgrep
  :ensure t
  :config
  (setq wgrep-auto-save-buffer t)
  (setq wgrep-enable-key "r"))

(use-package consult
  :config
  (setq consult-project-root-function #'projectile-project-root)
  ;; (setq consult-ripgrep-args "rg --null --hidden --line-buffered --color=never --max-columns=1000 --path-separator /   --smart-case --no-heading --line-number .")
  )

;; Find config example [[https://github.com/minad/cape][here]].
(use-package cape
  :init
  ;; Add `completion-at-point-functions', used by `completion-at-point'.
  (add-to-list 'completion-at-point-functions #'cape-dabbrev)
  (add-to-list 'completion-at-point-functions #'cape-file)
  (add-to-list 'completion-at-point-functions #'cape-history)
  (add-to-list 'completion-at-point-functions #'cape-symbol)
  )

(use-package emacs
  :init
  (setq completion-cycle-threshold 3)
  (setq tab-always-indent 'complete))

(use-package dabbrev
  :ensure nil
  ;; Swap M-/ and C-M-/
  :general
  (:states 'normal
	   "M-/" 'dabbrev-completion
	   "C-M-/" 'dabbrev-expand)
  :custom
  (dabbrev-ignored-buffer-regexps '("\\.\\(?:pdf\\|jpe?g\\|png\\)\\'")))
#+end_src

*** corfu

In buffer completion with child frame.

#+begin_src emacs-lisp
(use-package corfu
  :custom
  (corfu-cycle t)
  (corfu-auto t)
  :general
  (corfu-map
   "TAB"  'corfu-next
   "[tab]" 'corfu-next
   "S-TAB" 'corfu-previous
   "[backtab]" 'corfu-previous)
  :init
  (global-corfu-mode))

(use-package corfu-popupinfo
  :after corfu
  :ensure nil
  :init
  (corfu-popupinfo-mode 1))

;; (use-package corfu-echo
;;   :after corfu
;;   :straight nil
;;   :init
;;   (corfu-echo-mode 1))
#+end_src

*** COMMENT floating frame with =posframe=

#+begin_src emacs-lisp
(use-package vertico-posframe
  :after vertico
  :if (eq 'my/frame 'pos)
  :requires posframe
  :config
  (setq vertico-posframe-poshandler #'posframe-poshandler-frame-top-center)
  (setq vertico-posframe-parameters
	'((internal-border-width . 10)
	  (left-fringe . 8)
	  (right-fringe . 8)
	  ))
  (vertico-posframe-mode 1)
  )
#+end_src

** project

#+begin_src emacs-lisp
(use-package projectile
  :init
  (projectile-mode +1)
  :config
  (setq projectile-completion-system 'default))
#+end_src

** magit

*** self

#+begin_src emacs-lisp
(use-package magit
  :commands (magit-status magit-blame)
  :init
  ;; Have magit-status go full screen and quit to previous
  ;; configuration.  Taken from
  ;; http://whattheemacsd.com/setup-magit.el-01.html#comment-748135498
  ;; and http://irreal.org/blog/?p=2253
  (defadvice magit-status (around magit-fullscreen activate)
    (window-configuration-to-register :magit-fullscreen)
    ad-do-it
    (delete-other-windows))
  (defadvice magit-quit-window (after magit-restore-screen activate)
    (jump-to-register :magit-fullscreen))
  :custom
  (magit-diff-refine-hunk 'all)
  :config
  ;; (remove-hook 'magit-status-sections-hook 'magit-insert-tags-header)
  ;; (remove-hook 'magit-status-sections-hook 'magit-insert-status-headers)
  (remove-hook 'magit-status-sections-hook 'magit-insert-unpushed-to-pushremote)
  (remove-hook 'magit-status-sections-hook 'magit-insert-unpulled-from-pushremote)
  (remove-hook 'magit-status-sections-hook 'magit-insert-unpulled-from-upstream)
  (remove-hook 'magit-status-sections-hook 'magit-insert-unpushed-to-upstream-or-recent)
  )

(use-package git-gutter
  :after magit
  :init
  (global-git-gutter-mode +1))

(use-package git-gutter-fringe
  :after git-gutter
  :config
  (define-fringe-bitmap 'git-gutter-fr:added [224] nil nil '(center repeated))
  (define-fringe-bitmap 'git-gutter-fr:modified [224] nil nil '(center repeated))
  (define-fringe-bitmap 'git-gutter-fr:deleted [128 192 224 240] nil nil 'bottom))

;; it's slow: https://github.com/dandavison/magit-delta/issues/9
;; (use-package magit-delta
;;   :after magit
;;   :hook (magit-mode . magit-delta-mode))
;; (setq magit-refresh-status-buffer nil)
#+end_src

*** open files in browser

#+begin_src emacs-lisp
(use-package browse-at-remote
  :after magit
  :general
  (:keymaps '(dired-mode-map magit-log-mode-map magit-status-mode-map)
	    :states 'normal
	    "gb" 'browse-at-remote)
  )
#+end_src

*** github

#+begin_src emacs-lisp
(use-package forge
  :after magit)

(use-package consult-gh
  :after consult
  :config
  (setq consult-gh-default-orgs-list '("xiaoxinghu" "orgapp" "nib-group"))
  (setq consult-gh-default-clone-directory "~/Projects"))
#+end_src

*** Keybindings

#+begin_src emacs-lisp
(defhydra hydra-git (:hint nil)
  "git"
  ("g" magit-status "status" :color blue)
  ("b" browse-at-remote "browse" :color blue)
  ("s" magit-stage-buffer-file "stage" :color blue)
  ("S" consult-gh-search-repos "stage" :color blue)
  ("c" magit-commit "commit" :color blue)
  ("p" magit-push "push" :color blue)
  ("l" magit-log "log" :color blue)
  ("f" magit-log-buffer-file "log" :color blue)
  ;; ("b" magit-blame "blame" :color blue)
  ("q" nil "quit"))

(leader! "g" '("git" . hydra-git/body))
#+end_src

