home/emacs/init.el

(use-package dired
  :ensure nil
  :init
  (setq
   dired-dwim-target t
   ;; don't prompt to revert, just do it
   dired-auto-revert-buffer #'dired-buffer-stale-p
   ;; Always copy/delete recursively
   dired-recursive-copies  'always
   dired-recursive-deletes 'top
   auto-revert-remote-files nil
   ;; Ask whether destination dirs should get created when copying/removing files.
   dired-create-destination-dirs 'ask
   dired-listing-switches "-alh"))

;; (use-package dired-preview
;;   :after dired
;;   :hook (dired-mode . dired-preview-mode)
;;   :custom (dired-preview-delay 0))

(use-package diredfl
  :hook (dired-mode . diredfl-mode))

(general-define-key
   :keymaps '(wdired-mode-map local) "M-s" 'wdired-finish-edit)

(use-package treemacs
  :config
  (treemacs-follow-mode t)
  ;; (setq treemacs-no-png-images t)
  )

(use-package treemacs-evil
  :after (treemacs evil))

(use-package treemacs-projectile
  :after (treemacs projectile))

(use-package treemacs-all-the-icons
  :after (treemacs all-the-icons)
  :config
  (treemacs-load-theme "all-the-icons"))

;; (use-package treemacs-icons-dired
;;   :hook (dired-mode . treemacs-icons-dired-enable-once))

;; (use-package treemacs-magit
;;   :after (treemacs magit))

(use-package dwim-shell-command
  :bind (([remap shell-command] . dwim-shell-command)
          :map dired-mode-map
          ([remap dired-do-async-shell-command] . dwim-shell-command)
          ([remap dired-do-shell-command] . dwim-shell-command)
          ([remap dired-smart-shell-command] . dwim-shell-command))
  :config
  (defun my/dwim-shell-command-convert-to-gif ()
    "Convert all marked videos to optimized gif(s)."
    (interactive)
    (dwim-shell-command-on-marked-files
      "Convert to gif"
      "ffmpeg -loglevel quiet -stats -y -i <<f>> -pix_fmt rgb24 -r 15 <<fne>>.gif"
      :utils "ffmpeg")))

(use-package pdf-tools
  :mode ("\\.pdf\\'" . pdf-view-mode)
  :config
  (pdf-tools-install))

(use-package bookmark+
  ;; :straight (:host github :repo "emacsmirror/bookmark-plus")
  :general
  ("M-s-b" 'consult-bookmark))

(add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
(add-to-list 'default-frame-alist '(ns-appearance . dark))

(defun +macos-open-with (&optional app-name path)
  "Send PATH to APP-NAME on OSX."
  (interactive)
  (let* ((path (expand-file-name
                 (replace-regexp-in-string
                   "'" "\\'"
                   (or path (if (derived-mode-p 'dired-mode)
                              (dired-get-file-for-visit)
                              (buffer-file-name)))
                   nil t)))
          (command (format "open %s"
                     (if app-name
                       (format "-a %s '%s'" (shell-quote-argument app-name) path)
                       (format "'%s'" path)))))
    (message "Running: %s" command)
    (shell-command command)))

(defmacro +macos--open-with (id &optional app dir)
  `(defun ,(intern (format "+macos/%s" id)) ()
     (interactive)
     (+macos-open-with ,app ,dir)))

;;;###autoload (autoload '+macos/reveal-in-finder "os/macos/autoload" nil t)
(+macos--open-with reveal-in-finder "Finder" default-directory)

;;;###autoload (autoload '+macos/reveal-project-in-finder "os/macos/autoload" nil t)
(+macos--open-with reveal-project-in-finder "Finder"
                   (or (projectile-project-root) default-directory))

(leader!
  "o o" '+macos/reveal-in-finder)

(use-package org
  :config
  (setq
