m1/emacs/init.org
** self
#+begin_src emacs-lisp
(use-package org
  :config
  (setq
   org-directory my/notes-location
   org-src-preserve-indentation t
   org-goto-interface 'outline-path-completion
   org-outline-path-complete-in-steps nil
   org-format-latex-options (plist-put org-format-latex-options :scale 1.5)
   org-preview-latex-default-process 'dvisvgm
   org-agenda-window-setup 'only-window
   org-hide-emphasis-markers t
   org-return-follows-link t
   org-default-notes-file (concat org-directory "/inbox.org")
   org-todo-keywords
   '((sequence
      "TODO(t)"   ; a task
      "WAIT(w)"   ; waiting for something
      "|"
      "DONE(d)"   ; task is done
      "KILL(k)")) ; task is cancelled

   org-todo-keyword-faces
   '(("TODO" . org-todo)
     ("TO-READ" . org-todo)
     ("READING" . (:foreground "chartreuse3" :weight bold))
     ("WAITING" . (:foreground "orange" :weight bold))
     ("IDEA" . (:foreground "cyan3" :weight bold))
     ("DONE" . org-done)
     ("NO" . (:foreground "yellow" :weight bold))
     ("CANCELLED" . (:foreground "yellow" :weight bold))
     )
   ;; Edit settings
   org-auto-align-tags nil
   org-tags-column 0
   org-catch-invisible-edits 'show-and-error
   org-special-ctrl-a/e t
   org-insert-heading-respect-content t
   org-agenda-start-on-weekday nil

   ;; Org styling, hide markup etc.
   org-hide-emphasis-markers t
   org-pretty-entities t
   org-ellipsis "…"

   ;; Agenda styling
   org-agenda-tags-column 0
   ;; org-agenda-block-separator ?─
   ;; org-agenda-time-grid
   ;; '((daily today require-timed)
   ;;    (800 1000 1200 1400 1600 1800 2000)
   ;;    " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
   org-agenda-current-time-string
   "⭠ now ─────────────────────────────────────────────────")

  ;; templates
  (setq org-capture-templates
	'(("t" "Todo" entry (file+headline org-default-notes-file "Tasks")
	   "* TODO %?\n %i\n")
	  ("n" "Note" entry (file+headline org-default-notes-file "Notes")
	   "* %?\n %i\n")
	  ))

  ;; insert mode when capture
  (add-hook 'org-capture-mode-hook 'evil-insert-state)

  ;; babel
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((python . t)))

  (setq org-babel-python-command "python3"
	org-confirm-babel-evaluate nil))
#+end_src

** UI enhancement

Some tips can be found in [[https://github.com/pprevos/emacs-writing-studio/blob/master/modules/ews-rice-org.el][this project]] to rice up org.

- [ ] [[https://github.com/minad/org-modern][org-modern]] helps prettify org-mode. There are some options in there.
#+begin_src emacs-lisp
(use-package org-modern
  :hook
  (org-mode . global-org-modern-mode))
#+end_src

#+begin_src emacs-lisp
(setq-default line-spacing 2)
#+end_src

#+begin_src emacs-lisp
;; look and feel
(use-package olivetti)

(defun my/org-mode ()
  (olivetti-mode)
  (olivetti-set-width 80)
  ;; turn off line numbers
  (display-line-numbers-mode -1))

(add-hook 'org-mode-hook 'my/org-mode)
#+end_src

** key bind

#+begin_src emacs-lisp
(define-key org-mode-map (kbd "M-j")
  'org-goto)

(leader! 'org-mode-map "SPC" '("find heading" . org-goto))
;; (evil-define-key 'normal 'org-mode-map (kbd "<leader> SPC") '("find heading" . org-goto))

(general-define-key
 :keymaps 'org-agenda-mode-map
 :states 'motion
 "j" 'org-agenda-next-item
 "k" 'org-agenda-previous-item
 )

(general-define-key
 :keymaps 'org-mode-map
 :states 'motion
 "RET" 'org-open-at-point
 )

(local-leader! :keymaps 'org-mode-map
  "a" '("archive" . org-archive-subtree-default)
  "l" '("link" . org-cliplink)
  "r" '("refile" . +org/refile-to-file))


(leader!
  "a a" 'my/agenda
  "c" 'org-capture)
#+end_src

** agenda
#+begin_src emacs-lisp
;; Detecting Agenda Files
;; Got this from [[https://wohanley.com/posts/org-setup/][this post]].

;; (setq my/org-agenda-directory (expand-file-name "todo" org-directory))
(require 'find-lisp)

(defun my/find-org-files (directory)
  (find-lisp-find-files directory "\.org$"))

(defun who-org/agenda-files-update (&rest _)
  (let ((todo-zettels (->> (format "rg --files-with-matches '(TODO)|(NEXT)|(HOLD)|(WAITING)' %s" org-directory)
			   (shell-command-to-string)
			   (s-lines)
			   (-filter (lambda (line) (not (s-blank? line)))))))
    (setq org-agenda-files todo-zettels)))

(advice-add 'org-agenda :before #'who-org/agenda-files-update)

;; Faces and Colors
(with-no-warnings
  (custom-declare-face '+org-todo-active  '((t (:inherit (bold font-lock-constant-face org-todo)))) "")
  (custom-declare-face '+org-todo-idea '((t (:inherit (bold font-lock-doc-face org-todo)))) "")
  (custom-declare-face '+org-todo-onhold  '((t (:inherit (bold warning org-todo)))) "")
  (custom-declare-face '+org-todo-cancel  '((t (:inherit (bold error org-todo)))) ""))

(setq org-todo-keyword-faces
      '(("[-]"  . +org-todo-active)
	;; ("TODO"  . +org-todo-active)
	("[?]"  . +org-todo-onhold)
	("IDEA" . +org-todo-idea)
	;; ("HOLD" . +org-todo-onhold)
	("NO"   . +org-todo-cancel)))

;;;###autoload
(defun my/agenda ()
  (interactive)
  (org-agenda "a" "a")
  ;; (let ((org-agenda-span 'day)
	;; (org-super-agenda-groups
	;;  '(
	;;    (:name "Today"
	;; 	  :time-grid t
	;; 	  :date today
	;; 	  :scheduled today
	;; 	  :todo "TODO"
	;; 	  :order 1
	;; 	  )
	;;    ;; (:name "Today"
	;;    ;; 	  :scheduled today)
	;;    (:name "Important"
	;; 	  ;; Single arguments given alone
	;; 	  :priority "A")
	;;    (:name "Tasks" :and (:todo "TODO" :not (:category "inbox")))
	;;    )))
  ;;   (org-todo-list "TODO"))
  )

(use-package org-ql
  :after org
  :config
  (setq org-ql-views
	'(("TODO" :buffers-files org-agenda-files
	   :query (todo)
	   :super-groups '((:auto-category t)))))
  (setq org-agenda-custom-commands
	'(("a" "Agenda"
	   (
	    (agenda)

	    (org-ql-block '(and (todo)
				(deadline auto))
			  ((org-ql-block-header "DUE")))

	    (org-ql-block '(and (todo)
				(scheduled :on today))
			  ((org-ql-block-header "TODAY")))

	    (org-ql-block '(and (todo)
				(priority "A"))
			  ((org-ql-block-header "IMPORTANT")))

	    (org-ql-block '(and (todo "TODO") (not (habit)) (not (category "inbox")) (not (scheduled)))
			  ((org-ql-block-header "TASKS")))

	    (org-ql-block '(and (todo "TODO") (tags "book"))
			  ((org-ql-block-header "INPUT")))

	    (org-ql-block '(and (todo "IDEA"))
			  ((org-ql-block-header "IDEAS")))

	    ))))
  )
#+end_src

