m1/emacs/init.org
** roam

#+begin_src emacs-lisp
(use-package org-roam
  :after org
  :custom
  (org-roam-directory my/notes-location)
  (org-roam-dailies-directory "daily/")
  (org-roam-completion-everywhere t)
  (org-roam-node-display-template "${title:*} ${tags:10}")
  (org-roam-node-dailies-capture-template
   '(("d" "default" entry
      "* %?"
      :target (file+head "%<%Y-%m-%d>.org"
			 "#+title: %<%Y-%m-%d>\n"))))
  (org-roam-capture-templates
   '(("d" "default" plain "%?" :target
      (file+head "${slug}.org" "#+title: ${title}\n\n")
      :unnarrowed t)
     ("p" "project" plain "%?" :target
      (file+head "${slug}.org" "#+title: ${title}\n#+filetags: :project:\n\n")
      :unnarrowed t)
     ("l" "link" plain "* TO-READ %?\n" :target
      (file+head "resource.org" "Inbox")
      :unnarrowed t)
     ))
  :config
  (org-roam-setup))
#+end_src

*** functions
#+begin_src emacs-lisp
(defun my/org-find-project ()
  (interactive)
  (org-roam-node-find
   nil
   nil
   (lambda (node)
    (member "project" (org-roam-node-tags node)))))
#+end_src

*** keys
#+begin_src emacs-lisp
(defhydra hydra-notes (:hint nil)
  "notes"
  ("i" (find-file (expand-file-name "inbox.org" my/notes-location)) "inbox" :color blue)
  ("a" org-agenda "agenda" :color blue)
  ("n" org-roam-capture "Capture a note" :color blue)
  ("l" org-roam-buffer-toggle "links" :color blue)
  ("f" (affe-find denote-directory) "find notes" :color blue)
  ("s" (affe-grep denote-directory) "search notes" :color blue)
  ("j" denote-journal "journal" :color blue)
  ("t" org-roam-dailies-goto-today "Today" :color blue)
  ("q" nil "quit"))

(defhydra hydra-dailies (:hint nil)
  "daily notes"
  ("d" org-roam-dailies-goto-date "Goto date" :color blue)
  ("D" org-roam-dailies-capture-date "Capture date" :color blue)
  ("t" org-roam-dailies-goto-today "Goto today" :color blue)
  ("T" org-roam-dailies-capture-today "Capture today" :color blue)
  ("j" org-roam-dailies-goto-next-note "next" :color red)
  ("k" org-roam-dailies-goto-previous-note "previous" :color red)
  ("q" nil "quit"))

(leader! "n" '("notes" . hydra-notes/body))
(leader! "d" 'hydra-dailies/body)
(tyrant!
  "M-n" 'org-roam-node-find
  "M-N" 'my/org-find-project)
#+end_src

** other org-mode tools
#+begin_src emacs-lisp
(use-package evil-org
  :after org
  :hook (org-mode . (lambda () evil-org-mode))
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

(add-hook 'org-mode-hook
	  #'(lambda ()
	      (visual-line-mode)
	      (org-indent-mode)))


(setq org-image-actual-width nil)
(use-package org-download)
(use-package org-cliplink)
#+end_src

* Coding

** eldoc

Make it a box.

#+begin_src emacs-lisp
(use-package eldoc-box
  :general
  (general-nmap :keymaps 'eglot-mode-map "K" 'eldoc-box-help-at-point))
#+end_src

** COMMENT lsp

#+begin_src emacs-lisp
(use-package lsp-mode
  :commands lsp
  :custom
  (lsp-completion-provider :none) ;; we use Corfu instead
  (lsp-headerline-breadcrumb-enable nil)
  (lsp-headerline-breadcrumb-enable nil)
  :init
  ;; (setq lsp-keymap-prefix "C-c l")
  (defun my/lsp-mode-setup-completion ()
    (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
	  '(orderless))) ;; Configure orderless
  :hook
  ((typescript-mode . lsp)
   (web-mode . lsp)
   (typescript-ts-mode . lsp)
   (js2-mode . lsp)
   (js-mode . lsp)
   (js-ts-mode . lsp)
   (jsx-mode . lsp)
   (yaml-mode . lsp)
   (yaml-ts-mode . lsp)
   (lsp-mode . lsp-enable-which-key-integration)
   (lsp-completion-mode . my/lsp-mode-setup-completion))
  :config
  (evil-define-key 'normal 'global "gD" 'lsp-find-type-definition)
  (evil-define-key 'normal 'global "gr" 'lsp-find-references)
  (evil-define-key 'normal 'global "K" 'lsp-ui-doc-glance)
  ;; (evil-define-key 'normal 'global "gr" 'lsp-find-references)
  (evil-define-key 'normal 'global "gR" 'lsp-rename)
  (evil-define-key 'normal 'global (kbd "M-.") 'lsp-execute-code-action))

;; (with-eval-after-load 'lsp-mode
;;   (add-hook 'lsp-mode-hook #'lsp-enable-which-key-integration))

(use-package lsp-ui
  :hook
  (lsp-mode . lsp-ui-mode)
  :config
  (setq lsp-ui-doc-show-with-cursor nil))

(use-package consult-lsp
  :after (lsp-mode))

;; Key bindings.

(defhydra hydra-lsp (:hint nil)
  "lsp"
  ("s" consult-lsp-file-symbols "symbols" :color blue)
  ("r" lsp-find-references "reference" :color blue)
  ("R" lsp-rename "rename" :color blue)
  ("o" lsp-organize-imports "org imports" :color blue)
  ("q" nil "quit"))


;; (evil-define-minor-mode-key 'normal lsp-mode (kbd "SPC l") lsp-command-map)
(general-def 'normal lsp-mode :definer 'minor-mode
  "M-l" 'hydra-lsp/body)
#+end_src

** eglot
#+begin_src emacs-lisp
(use-package eglot
  :hook
  ((
    typescript-mode
    web-mode
    js2-mode
    js-mode
    yaml-mode
    python-mode
    js-ts-mode
    typescript-ts-mode
    yaml-ts-mode
    ) . eglot-ensure)

  :config
  (add-to-list
   'eglot-server-programs
   `(astro-mode . ("astro-ls" "--stdio" :initializationOptions (:typescript (:tsdk ,my/typescript-path)))))
  (add-to-list
   'eglot-server-programs
   `(jsx-mode . ("typescript-language-server" "--stdio")))
)
#+end_src

** treesitter

#+begin_src emacs-lisp
(use-package treesit-auto
  :config
  (global-treesit-auto-mode))
#+end_src

#+begin_src emacs-lisp :tangle no
(use-package treesit
  :if EMACS29+
  :ensure nil
  :commands (treesit-install-language-grammar nf/treesit-install-all-languages)
  :init
  (setq treesit-language-source-alist
	'((bash . ("https://github.com/tree-sitter/tree-sitter-bash"))
	  (c . ("https://github.com/tree-sitter/tree-sitter-c"))
	  (cpp . ("https://github.com/tree-sitter/tree-sitter-cpp"))
	  (css . ("https://github.com/tree-sitter/tree-sitter-css"))
	  ;; (go . ("https://github.com/tree-sitter/tree-sitter-go"))
	  (html . ("https://github.com/tree-sitter/tree-sitter-html"))
	  (javascript . ("https://github.com/tree-sitter/tree-sitter-javascript"))
	  (json . ("https://github.com/tree-sitter/tree-sitter-json"))
	  (lua . ("https://github.com/Azganoth/tree-sitter-lua"))
	  (make . ("https://github.com/alemuller/tree-sitter-make"))
	  ;; (ocaml . ("https://github.com/tree-sitter/tree-sitter-ocaml" "ocaml/src" "ocaml"))
	  (python . ("https://github.com/tree-sitter/tree-sitter-python"))
	  ;; (php . ("https://github.com/tree-sitter/tree-sitter-php"))
	  (typescript . ("https://github.com/tree-sitter/tree-sitter-typescript" "typescript/src" "typescript"))
	  (ruby . ("https://github.com/tree-sitter/tree-sitter-ruby"))
	  (rust . ("https://github.com/tree-sitter/tree-sitter-rust"))
	  (sql . ("https://github.com/m-novikov/tree-sitter-sql"))
	  (toml . ("https://github.com/tree-sitter/tree-sitter-toml"))
	  (astro . ("https://github.com/virchau13/tree-sitter-astro"))
	  ;; (zig . ("https://github.com/GrayJack/tree-sitter-zig"))
	  (yaml . ("https://github.com/ikatyang/tree-sitter-yaml"))
	  ))
  :config
  (defun nf/treesit-install-all-languages ()
    "Install all languages specified by `treesit-language-source-alist'."
    (interactive)
    (let ((languages (mapcar 'car treesit-language-source-alist)))
      (dolist (lang languages)
	(treesit-install-language-grammar lang)
	(message "`%s' parser was installed." lang)
	(sit-for 0.75))))
  (push '(javascript-mode . js-ts-mode) major-mode-remap-alist)
  (push '(typescript-mode . typescript-ts-mode) major-mode-remap-alist)
  (push '(python-mode . python-ts-mode) major-mode-remap-alist)
  (push '(c-mode . c-ts-mode) major-mode-remap-alist)
  (push '(json-mode . json-ts-mode) major-mode-remap-alist)
  (push '(yaml-mode . yaml-ts-mode) major-mode-remap-alist)
  (treesit-major-mode-setup))
#+end_src

