home/emacs/init.el

(use-package org-roam
  :after org
  :custom
  (org-roam-directory my/notes-location)
  (org-roam-dailies-directory "daily/")
  (org-roam-completion-everywhere t)
  (org-roam-node-display-template "${title:*} ${tags:10}")
  (org-roam-node-dailies-capture-template
   '(("d" "default" entry
      "* %?"
      :target (file+head "%<%Y-%m-%d>.org"
			 "#+title: %<%Y-%m-%d>\n"))))
  (org-roam-capture-templates
   '(("d" "default" plain "%?" :target
      (file+head "${slug}.org" "#+title: ${title}\n\n")
      :unnarrowed t)
     ("p" "project" plain "%?" :target
      (file+head "${slug}.org" "#+title: ${title}\n#+filetags: :project:\n\n")
      :unnarrowed t)
     ("l" "link" plain "* TO-READ %?\n" :target
      (file+head "resource.org" "Inbox")
      :unnarrowed t)
     ))
  :config
  (org-roam-setup))

(defun my/org-find-project ()
  (interactive)
  (org-roam-node-find
   nil
   nil
   (lambda (node)
    (member "project" (org-roam-node-tags node)))))



(use-package evil-org
  :after org
  :hook (org-mode . (lambda () evil-org-mode))
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

(add-hook 'org-mode-hook
	  #'(lambda ()
	      (visual-line-mode)
	      (org-indent-mode)))

;; look and feel
(use-package olivetti)

(defun my/org-mode ()
  (olivetti-mode)
  (olivetti-set-width 80)
  ;; turn off line numbers
  (display-line-numbers-mode -1))

(add-hook 'org-mode-hook 'my/org-mode)

(setq org-image-actual-width nil)
(use-package org-download)
(use-package org-cliplink)

(use-package lsp-mode
  :commands lsp
  :custom
  (lsp-completion-provider :none) ;; we use Corfu instead
  (lsp-headerline-breadcrumb-enable nil)
  (lsp-headerline-breadcrumb-enable nil)
  :init
  ;; (setq lsp-keymap-prefix "C-c l")
  (defun my/lsp-mode-setup-completion ()
    (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
	  '(orderless))) ;; Configure orderless
  :hook
  ((typescript-mode . lsp)
   (web-mode . lsp)
   (typescript-ts-mode . lsp)
   (js2-mode . lsp)
   (js-mode . lsp)
   (js-ts-mode . lsp)
   (jsx-mode . lsp)
   (yaml-mode . lsp)
   (yaml-ts-mode . lsp)
   (lsp-mode . lsp-enable-which-key-integration)
   (lsp-completion-mode . my/lsp-mode-setup-completion))
  :config
  (evil-define-key 'normal 'global "gD" 'lsp-find-type-definition)
  (evil-define-key 'normal 'global "gr" 'lsp-find-references)
  (evil-define-key 'normal 'global "K" 'lsp-ui-doc-glance)
  ;; (evil-define-key 'normal 'global "gr" 'lsp-find-references)
  (evil-define-key 'normal 'global "gR" 'lsp-rename)
  (evil-define-key 'normal 'global (kbd "M-.") 'lsp-execute-code-action))

;; (with-eval-after-load 'lsp-mode
;;   (add-hook 'lsp-mode-hook #'lsp-enable-which-key-integration))

(use-package lsp-ui
  :hook
  (lsp-mode . lsp-ui-mode)
  :config
  (setq lsp-ui-doc-show-with-cursor nil))

(use-package consult-lsp
  :after (lsp-mode))

;; Key bindings.

(defhydra hydra-lsp (:hint nil)
  "lsp"
  ("s" consult-lsp-file-symbols "symbols" :color blue)
  ("r" lsp-find-references "reference" :color blue)
  ("R" lsp-rename "rename" :color blue)
  ("o" lsp-organize-imports "org imports" :color blue)
  ("q" nil "quit"))


;; (evil-define-minor-mode-key 'normal lsp-mode (kbd "SPC l") lsp-command-map)
(general-def 'normal lsp-mode :definer 'minor-mode
  "M-l" 'hydra-lsp/body)

(use-package treesit-auto
  :config
  (global-treesit-auto-mode))
