m1/emacs/init.el

(use-package org-roam
  :after org
  :custom
  (org-roam-directory my/notes-location)
  (org-roam-dailies-directory "daily/")
  (org-roam-completion-everywhere t)
  (org-roam-node-display-template "${title:*} ${tags:10}")
  (org-roam-node-dailies-capture-template
   '(("d" "default" entry
      "* %?"
      :target (file+head "%<%Y-%m-%d>.org"
			 "#+title: %<%Y-%m-%d>\n"))))
  (org-roam-capture-templates
   '(("d" "default" plain "%?" :target
      (file+head "${slug}.org" "#+title: ${title}\n\n")
      :unnarrowed t)
     ("p" "project" plain "%?" :target
      (file+head "${slug}.org" "#+title: ${title}\n#+filetags: :project:\n\n")
      :unnarrowed t)
     ("l" "link" plain "* TO-READ %?\n" :target
      (file+head "resource.org" "Inbox")
      :unnarrowed t)
     ))
  :config
  (org-roam-setup))

(defun my/org-find-project ()
  (interactive)
  (org-roam-node-find
   nil
   nil
   (lambda (node)
    (member "project" (org-roam-node-tags node)))))

(defhydra hydra-notes (:hint nil)
  "notes"
  ("i" (find-file (expand-file-name "inbox.org" my/notes-location)) "inbox" :color blue)
  ("a" org-agenda "agenda" :color blue)
  ("n" org-roam-capture "Capture a note" :color blue)
  ("l" org-roam-buffer-toggle "links" :color blue)
  ("f" (affe-find denote-directory) "find notes" :color blue)
  ("s" (affe-grep denote-directory) "search notes" :color blue)
  ("j" denote-journal "journal" :color blue)
  ("t" org-roam-dailies-goto-today "Today" :color blue)
  ("q" nil "quit"))

(defhydra hydra-dailies (:hint nil)
  "daily notes"
  ("d" org-roam-dailies-goto-date "Goto date" :color blue)
  ("D" org-roam-dailies-capture-date "Capture date" :color blue)
  ("t" org-roam-dailies-goto-today "Goto today" :color blue)
  ("T" org-roam-dailies-capture-today "Capture today" :color blue)
  ("j" org-roam-dailies-goto-next-note "next" :color red)
  ("k" org-roam-dailies-goto-previous-note "previous" :color red)
  ("q" nil "quit"))

(leader! "n" '("notes" . hydra-notes/body))
(leader! "d" 'hydra-dailies/body)
(tyrant!
  "M-n" 'org-roam-node-find
  "M-N" 'my/org-find-project)

(use-package evil-org
  :after org
  :hook (org-mode . (lambda () evil-org-mode))
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

(add-hook 'org-mode-hook
	  #'(lambda ()
	      (visual-line-mode)
	      (org-indent-mode)))


(setq org-image-actual-width nil)
(use-package org-download)
(use-package org-cliplink)

(use-package eglot
  :hook
  ((
    typescript-mode
    web-mode
    js2-mode
    js-mode
    yaml-mode
    python-mode
    js-ts-mode
    typescript-ts-mode
    yaml-ts-mode
    ) . eglot-ensure)
)

(use-package treesit-auto
  :config
  (global-treesit-auto-mode))
