m1/emacs/init.org
** coding tools
https://github.com/radian-software/apheleia, fast code formatting that doesn't drag your emacs down.
#+begin_src emacs-lisp
(use-package apheleia
  :ensure t
  :config
  (apheleia-global-mode +1))

;; Automatically make file executable when =shebang= is found.
(add-hook 'after-save-hook
	  'executable-make-buffer-file-executable-if-script-p)
#+end_src

#+begin_src emacs-lisp
(use-package editorconfig
  :config
  (editorconfig-mode 1))
#+end_src

[[https://github.com/Fuco1/smartparens][smartmarens]]: Minor mode for Emacs that deals with parens pairs and tries to be smart about it.
I use to mostly for the automatically closing. Should take a look at other features:
- wrap, unwrap, rewrap
- expand and contract pairs? (is it useful?)
- navigate pairs

#+begin_src emacs-lisp
(use-package smartparens
  :config
  (require 'smartparens-config)
  (add-hook 'prog-mode-hook #'smartparens-mode))
#+end_src

Code folding. TBH, I don't fold my code.
#+begin_src emacs-lisp
(use-package origami
  :config
  (global-origami-mode))
#+end_src

Documents is always useful.
#+begin_src emacs-lisp
(use-package eldoc
  :ensure nil
  :config
  (setq eldoc-idle-delay 0
	eldoc-echo-area-use-multiline-p nil))
#+end_src

** flymake

#+begin_src emacs-lisp
(defhydra hydra-check (:hint nil)
  "flymake"
  ("j" flymake-goto-next-error "next error")
  ("k" flymake-goto-prev-error "prev error")
  ("l" flymake-show-buffer-diagnostics "list errors" :color blue)
  ("a" eglot-code-actions "action" :color blue)
  ("o" eglot-code-action-organize-imports "orgnize import" :color blue)
  ("q" nil "quit"))

;; (tyrant!
;;   :states '(normal)
;;   ";" 'hydra-check/body)
#+end_src

** my own tools

*** shebang

Insert shebang based on the file type.

#+begin_src emacs-lisp
(defgroup shebang nil
  "Shebang."
  :group 'extensions)

(defcustom shebang-env-path "/usr/bin/env"
  "Path to the env executable."
  :type 'string
  :group 'shebang)

(defcustom shebang-interpretor-map
  '(("sh" . "bash")
    ("py" . "python3")
    ("js" . "deno run")
    ("mjs" . "deno run")
    ("ts" . "deno run")
    ("rb" . "ruby"))
  "Alist of interpretors and their paths."
  :type '(alist :key-type (string :tag "Extension")
           :value-type (string :tag "Interpreter"))
  :group 'shebang)

(defun guess-shebang-command ()
  "Guess the command to use for the shebang."
  (let ((ext (file-name-extension (buffer-file-name))))
    (or (cdr (assoc ext shebang-interpretor-map))
        ext)))

(defun insert-shebang ()
  "Insert shebang line at the top of the buffer."
  (interactive)
  (goto-char (point-min))
  (insert (format "#!%s %s" shebang-env-path (guess-shebang-command)))
  (newline))

(leader! "ib" '(insert-shebang :which-key "insert shebang"))
#+end_src

*** run

Run the current buffer.

#+begin_src emacs-lisp
(defgroup run nil
  "Run."
  :group 'extensions)

(defcustom run-ext-command-map
  '(("sh" . "bash")
    ("py" . "python3")
    ("js" . "deno run")
    ("ts" . "deno run")
    ("mjs" . "deno run")
    ("rb" . "ruby"))
  "Alist of interpretors and their paths."
  :type '(alist :key-type (string :tag "Extension")
           :value-type (string :tag "Command"))
  :group 'run)

(defun get-command (file)
  "Get command for executing FILE.

Return the FILE when the file is executable.
Return the command from the run-ext-command-map otherwise"
  (if (file-executable-p file)
      file
    (let ((ext (file-name-extension file)))
      (format "%s %s" (cdr (assoc ext run-ext-command-map)) file))))

(defun run-buffer ()
  "Run the current buffer."
  (interactive)
  (when (not (buffer-file-name)) (save-buffer))
  (when (buffer-modified-p) (save-buffer))
  (let* (
          ($outputb "*run output*")
          (resize-mini-windows nil)
          ($fname (buffer-file-name))
          ($cmd (get-command $fname))
          )
    (progn
      (message "Running %s" $cmd)
      (shell-command $cmd $outputb)
      )))
#+end_src

** copilot

#+begin_src emacs-lisp
(use-package copilot
  :ensure nil
  :hook (prog-mode . copilot-mode)
  :bind (("C-TAB" . 'copilot-accept-completion-by-word)
          ("C-<tab>" . 'copilot-accept-completion-by-word)
          :map copilot-completion-map
          ("<tab>" . 'copilot-accept-completion)
          ("TAB" . 'copilot-accept-completion)))
#+end_src

* Languages

** nix

#+begin_src emacs-lisp
(use-package nix-mode
  :mode "\\.nix\\'")
#+end_src

** js

Basic settings.
#+begin_src emacs-lisp
(setq js-indent-level 2)
#+end_src

Web mode for the web stuff.

#+begin_src emacs-lisp
(use-package web-mode
  :mode (("\\.html?\\'" . web-mode)
         ("\\.css\\'"   . web-mode)
         ("\\.svelte\\'"   . web-mode)
         ("\\.[t|j]sx\\'"  . jsx-mode))
  :custom
  (web-mode-markup-indent-offset 2)
  (web-mode-css-indent-offset 2)
  (web-mode-code-indent-offset 2)
  :config
  ;; https://github.com/emacs-typescript/typescript.el/issues/4#issuecomment-947866123
  (define-derived-mode jsx-mode web-mode "jsx")
  (setq web-mode-content-types-alist '(("jsx" . "\\.js[x]?\\'")))
  (with-eval-after-load 'lsp-mode
    (add-to-list 'lsp--formatting-indent-alist '(jsx-mode . js-indent-level))))
#+end_src

JavaScript stuff.
#+begin_src emacs-lisp
(use-package javascript-mode
  :ensure nil
  :mode (("\\.[m|c]?js\\'" . javascript-mode))
  :config
  (setq js-indent-level 2))
#+end_src

TypeScript.
#+begin_src emacs-lisp
(use-package typescript-mode
  :mode (("\\.ts\\'" . typescript-mode))
  :init
  ;; (autoload 'typescript-tsx-mode "typescript-mode" nil t)
  ;; (add-to-list 'auto-mode-alist
  ;; 	       (cons "\\.tsx\\'"
  ;; 		     #'typescript-tsx-mode))
  :config
  ;; (define-derived-mode typescript-tsx-mode web-mode "tsx")
  (setq typescript-indent-level 2))
#+end_src

Astro.

#+begin_src emacs-lisp
(define-derived-mode astro-mode web-mode "astro")
(setq auto-mode-alist
      (append '((".*\\.astro\\'" . astro-mode))
              auto-mode-alist))

;; (with-eval-after-load 'lsp-mode
;;   (add-to-list 'lsp-language-id-configuration
;;                '(astro-mode . "astro")))
#+end_src

