m1/emacs/init.org
** lua
#+begin_src emacs-lisp
(use-package lua-mode
  :init
  ;; lua-indent-level defaults to 3 otherwise. Madness.
  (setq lua-indent-level 2)
)
#+end_src

** rust

#+begin_src emacs-lisp
(use-package rustic
  :mode ("\\.rs\\'" . rustic-mode)
  :config
  (setq rustic-lsp-server 'rust-analyzer))
#+end_src

** npm mode

=npm-mode=. Do I need this?

#+begin_src emacs-lisp :tangle no
(use-package npm-mode
  :ensure nil
  :hook ((js-mode js-ts-mode typescript-mode typescript-ts-mode web-mode) . npm-mode))
#+end_src

** json

#+begin_src emacs-lisp
(use-package json-mode
  :mode "\\.js\\(?:on\\|[hl]int\\(?:rc\\)?\\)\\'"
  :init
  :config
  ;; (map! :after json-mode
  ;;       :map json-mode-map
  ;;       :localleader
  ;;       :desc "Copy path" "p" #'json-mode-show-path
  ;;       "t" #'json-toggle-boolean
  ;;       "d" #'json-mode-kill-path
  ;;       "x" #'json-nullify-sexp
  ;;       "+" #'json-increment-number-at-point
  ;;       "-" #'json-decrement-number-at-point
  ;;       "f" #'json-mode-beautify)
  )
#+end_src

** yaml

#+begin_src emacs-lisp
(use-package yaml-mode)
#+end_src

** csv

#+begin_src emacs-lisp
(use-package csv-mode)
#+end_src

** markdown
#+begin_src emacs-lisp
(use-package markdown-mode
  :mode "\\.md\\'"
  :config
  (setq markdown-command "multimarkdown")
  (unbind-key "M-p" markdown-mode-map))
#+end_src
