m1/emacs/init.el

(use-package lua-mode
  :init
  ;; lua-indent-level defaults to 3 otherwise. Madness.
  (setq lua-indent-level 2)
)

(use-package rustic
  :mode ("\\.rs\\'" . rustic-mode)
  :config
  (setq rustic-lsp-server 'rust-analyzer))

(use-package json-mode
  :mode "\\.js\\(?:on\\|[hl]int\\(?:rc\\)?\\)\\'"
  :init
  :config
  ;; (map! :after json-mode
  ;;       :map json-mode-map
  ;;       :localleader
  ;;       :desc "Copy path" "p" #'json-mode-show-path
  ;;       "t" #'json-toggle-boolean
  ;;       "d" #'json-mode-kill-path
  ;;       "x" #'json-nullify-sexp
  ;;       "+" #'json-increment-number-at-point
  ;;       "-" #'json-decrement-number-at-point
  ;;       "f" #'json-mode-beautify)
  )

(use-package yaml-mode)

(use-package csv-mode)

(use-package markdown-mode
  :mode "\\.md\\'"
  :config
  (setq markdown-command "multimarkdown")
  (unbind-key "M-p" markdown-mode-map))
